const questions = {
  '1': {
    wordCount: 40,
    text:
      '蔣家羊，楊家牆，蔣家羊撞倒了楊家牆，楊家牆壓死了蔣家羊，楊家要蔣家賠牆，蔣家要楊家賠羊。',
  },
  '2': {
    wordCount: 43,
    text:
      '坡上立著一隻鵝，坡下就是一條河。寬寬的河，肥肥的鵝，鵝要過河，河要渡鵝，不知是鵝過河，還是河渡鵝？',
  },
  '3': {
    wordCount: 44,
    text:
      '山上五棵樹，架上五壺醋，林中五隻鹿，箱裡五條褲。伐了山上樹，搬下架上的醋，射死林中的鹿，取出箱中的褲',
  },
  '4': {
    wordCount: 52,
    text:
      '扁擔長，板凳寬，板凳沒有扁擔長，扁擔沒有板凳寬。扁擔要綁在板凳上，板凳不讓扁擔綁在板凳上，扁擔偏要扁擔綁在板凳上。',
  },
  '5': {
    wordCount: 30,
    text: '老龍惱怒鬧老農，老農惱怒鬧老龍。農怒龍惱農更怒，龍惱農怒龍怕農。',
  },
  '6': {
    wordCount: 52,
    text:
      '出南門，走六步，見著六叔和六舅，叫聲六叔和六舅，借我六鬥六升好綠豆；過了秋，打了豆，還我六叔六舅六十六鬥六升好綠豆。',
  },
  '7': {
    wordCount: 69,
    text:
      '一個跛子，牽著驢子; 一個駝子，拉著車子﹔一個瞎子，抱著孩子。 跛子的驢子，撞著駝子的車子﹔駝子的車子，碰倒瞎子的孩子; 瞎子要打駝子，駝子要打跛子。',
  },
  '8': {
    wordCount: 43,
    text:
      '山前有個嚴圓眼，山後有個嚴眼圓，二人山前來比眼，不知是嚴圓眼的眼圓，還是嚴眼圓比嚴圓眼的眼圓？',
  },
  '9': {
    wordCount: 66,
    text:
      '藍教練是女教練，呂教練是男教練，藍教練不是男教練，呂教練不是女教練。藍南是男籃主力，呂柟是女籃主力，呂教練在男籃訓練藍南，藍教練在女籃訓練呂柟。',
  },
  '10': {
    wordCount: 63,
    text:
      '七巷一個漆匠，西巷一個錫匠。七巷漆匠用了西巷錫匠的錫，西巷錫匠拿了七巷漆匠的漆。七巷漆匠氣西巷錫匠用了漆，西巷錫匠譏七巷漆匠拿了錫。',
  },
  '11': {
    wordCount: 136,
    text:
      '柳林鎮有個六號樓，劉老六住在六號樓。有一天，來了牛老六，牽了六隻猴；來了侯老六，拉了六頭牛；來了仇老六，提了六簍油；來了尤老六，背了六匹綢。牛老六、侯老六、仇老六、尤老六，住上劉老六的六號樓，半夜裡，牛抵猴，猴鬥牛，撞倒了仇老六的油，油壞了尤老六的綢。牛老六幫仇老六收起油，侯老六幫尤老六洗掉綢上油',
  },
  '12': {
    wordCount: 101,
    text:
      '司小四和史小世，四月十四日十四時四十上集市，司小四買了四十四斤四兩西紅柿，史小世買了十四斤四兩細蠶絲。司小四要拿四十四斤四兩西紅柿換史小世十四斤四兩細蠶絲。史小世十四斤四兩細蠶絲不換司小四四十四斤四兩西紅柿。',
  },
}

const pairs = [
  [1, 2],
  [3, 4],
  [5, 6],
  [7, 8],
  [9, 10],
  [11, 12],
]

export { pairs, questions }
